# Average Coders

### Gathering and Cleaning the Data

In [2]:
import pandas as pd
import requests
import json
import time

Interest Rates

In [3]:
# Read the interest rate CSV files and load into a dataframe
# Short term interest rates are represented by the 3-month US Treasury Yield
short_term_csv = "Interest_Rates/US_Treasury/GS3M.csv"
short_term_df = pd.read_csv (short_term_csv)
short_term_df.rename(columns={"DATE":"date", "VALUE":"st_interest"}, inplace=True)
print(f'The number of rows of data for 3-month Treasury is {len(short_term_df.index)}')
short_term_df.head()

The number of rows of data for 3-month Treasury is 444

         date  st_interest
0  1982-01-01        12.92
1  1982-02-01        14.28
2  1982-03-01        13.31
3  1982-04-01        13.34
4  1982-05-01        12.71

In [4]:
# Intermediate term interest rates are represented by the 2-year US Treasury Yield
interm_term_csv = "Interest_Rates/US_Treasury/GS2.csv"
interm_term_df = pd.read_csv (interm_term_csv)
interm_term_df.rename(columns={"DATE":"date", "VALUE":"it_interest"}, inplace=True)
print(f'The number of rows of data for 2-year Treasury is {len(interm_term_df.index)}')
interm_term_df.head()

The number of rows of data for 2-year Treasury is 511

         date  it_interest
0  1976-06-01         7.06
1  1976-07-01         6.85
2  1976-08-01         6.63
3  1976-09-01         6.42
4  1976-10-01         5.98

In [5]:
# Long term interest rates are represented by the 10-year US Treasury Yield
long_term_csv = "Interest_Rates/US_Treasury/GS10.csv"
long_term_df = pd.read_csv (long_term_csv)
long_term_df.rename(columns={"DATE":"date", "VALUE":"lt_interest"}, inplace=True)
print(f'The number of rows of data for 10-year Treasury is {len(long_term_df.index)}')
long_term_df.head()

The number of rows of data for 10-year Treasury is 789

         date  lt_interest
0  1953-04-01         2.83
1  1953-05-01         3.05
2  1953-06-01         3.11
3  1953-07-01         2.93
4  1953-08-01         2.95

In [6]:
# Merge the Short, Intermediate and Long Term Treasury Yields into one dataframee
merged_si = pd.merge (short_term_df, interm_term_df, on="date")
interest_rates_df = pd.merge (merged_si, long_term_df, on="date")
print(f'The number of rows of data for all interest rates is {len(interest_rates_df.index)}')
interest_rates_df.head()

The number of rows of data for all interest rates is 444

         date  st_interest  it_interest  lt_interest
0  1982-01-01        12.92        14.57        14.59
1  1982-02-01        14.28        14.82        14.43
2  1982-03-01        13.31        14.19        13.86
3  1982-04-01        13.34        14.20        13.87
4  1982-05-01        12.71        13.78        13.62

Inflation

In [7]:
# Read the CPI Inflation data
inflation_csv = "CPI_Inflation/monthly_cpi.csv"
inflation_df = pd.read_csv (inflation_csv)
print(f'The number of rows of data for CPI Inflation is {len(inflation_df.index)}')
inflation_df.head()

The number of rows of data for CPI Inflation is 869

         date  cpi_index  pct_chg_cpi
0  1947-01-01      21.48          NaN
1  1947-02-01      21.62          NaN
2  1947-03-01      22.00          NaN
3  1947-04-01      22.00          NaN
4  1947-05-01      21.95          NaN

In [8]:
# Merge the Interest Rates and Inflation into one dataframee
int_and_infl_df = pd.merge (interest_rates_df, inflation_df, on="date")
print(f'The number of rows of data for interest rates and inflation is {len(int_and_infl_df.index)}')
int_and_infl_df.head()

The number of rows of data for interest rates and inflation is 444

         date  st_interest  it_interest  lt_interest  cpi_index  pct_chg_cpi
0  1982-01-01        12.92        14.57        14.59       94.4         8.26
1  1982-02-01        14.28        14.82        14.43       94.7         7.61
2  1982-03-01        13.31        14.19        13.86       94.7         6.88
3  1982-04-01        13.34        14.20        13.87       95.0         6.62
4  1982-05-01        12.71        13.78        13.62       95.9         6.91

Oil Prices

In [9]:
# Read the oil price data
oil_csv = "Oil_Prices/monthly_oil_prices.csv"
oil_df = pd.read_csv (oil_csv)
print(f'The number of rows of data for Oil Prices is {len(oil_df.index)}')
oil_df.head()

The number of rows of data for Oil Prices is 401

         date  oil_price  pct_chg_oil_price
0  1986-01-01      22.93                NaN
1  1986-02-01      15.46                NaN
2  1986-03-01      12.61                NaN
3  1986-04-01      12.84                NaN
4  1986-05-01      15.38                NaN

In [10]:
# Merge the Oil Prices into the main dataframee
ii_and_oil_df = pd.merge (int_and_infl_df, oil_df, on="date")
print(f'The number of rows of data for the main dataframe is now {len(ii_and_oil_df.index)}')
ii_and_oil_df.head()

The number of rows of data for the main dataframe is now 396

,date,st_interest,it_interest,lt_interest,cpi_index,pct_chg_cpi,oil_price,pct_chg_oil_price
0,1986-01-01,7.30,8.14,9.19,109.9,3.97,22.93,NaN
1,1986-02-01,7.29,7.97,8.70,109.7,3.20,15.46,NaN
2,1986-03-01,6.76,7.21,7.78,109.1,2.15,12.61,NaN
3,1986-04-01,6.24,6.70,7.30,108.7,1.59,12.84,NaN
4,1986-05-01,6.33,7.07,7.71,109.0,1.68,15.38,NaN

Mortgage Originations Data

In [11]:
# Read the mortgage data
mortgage_csv = "Mortgage_data/mortgage_data.csv"
mortgage_df = pd.read_csv (mortgage_csv)
print(f'The number of rows of data for Mortgage Data is {len(mortgage_df.index)}')
mortgage_df.head()

The number of rows of data for Mortgage Data is 358

         date  mtg_purchase  mtg_refi  pct_chg_mtg_purchase  pct_cht_mtg_refi
0  1990-01-01          31.0       7.0                   NaN               NaN
1  1990-02-01          31.0       7.0                   NaN               NaN
2  1990-03-01          31.0       7.0                   NaN               NaN
3  1990-04-01          36.0       5.0                   NaN               NaN
4  1990-05-01          36.0       5.0                   NaN               NaN

In [12]:
# Merge the Mortgage Data into the main dataframee
main_and_mortgage_df = pd.merge (ii_and_oil_df, mortgage_df, on="date")
print(f'The number of rows of data for the main dataframe is now {len(main_and_mortgage_df.index)}')
main_and_mortgage_df.head()

The number of rows of data for the main dataframe is now 348

,date,st_interest,it_interest,lt_interest,cpi_index,pct_chg_cpi,oil_price,pct_chg_oil_price,mtg_purchase,mtg_refi,pct_chg_mtg_purchase,pct_cht_mtg_refi
0,1990-01-01,7.90,8.09,8.21,127.5,5.20,22.86,26.86,31.0,7.0,NaN,NaN
1,1990-02-01,8.00,8.37,8.47,128.0,5.26,22.11,23.24,31.0,7.0,NaN,NaN
2,1990-03-01,8.17,8.63,8.59,128.6,5.24,20.39,4.67,31.0,7.0,NaN,NaN
3,1990-04-01,8.04,8.72,8.79,128.9,4.71,18.43,-12.53,36.0,5.0,NaN,NaN
4,1990-05-01,8.01,8.64,8.76,129.1,4.37,18.20,-9.54,36.0,5.0,NaN,NaN

US Employment

In [13]:
# Read the employment data
employment_csv = "US_Employment/monthly_employment.csv"
employment_df = pd.read_csv (employment_csv)
print(f'The number of rows of data for Employment Data is {len(employment_df.index)}')
employment_df.head()

The number of rows of data for Employment Data is 965

         date  employment  pct_chg_employment
0  1939-01-01       29923                 NaN
1  1939-02-01       30100                 NaN
2  1939-03-01       30280                 NaN
3  1939-04-01       30094                 NaN
4  1939-05-01       30299                 NaN

In [14]:
# Merge the Employment Data into the main dataframee
main_and_employment_df = pd.merge (main_and_mortgage_df, employment_df, on="date")
print(f'The number of rows of data for the main dataframe is now {len(main_and_employment_df.index)}')
main_and_employment_df.head()

The number of rows of data for the main dataframe is now 348

,date,st_interest,it_interest,lt_interest,cpi_index,pct_chg_cpi,oil_price,pct_chg_oil_price,mtg_purchase,mtg_refi,pct_chg_mtg_purchase,pct_cht_mtg_refi,employment,pct_chg_employment
0,1990-01-01,7.90,8.09,8.21,127.5,5.20,22.86,26.86,31.0,7.0,NaN,NaN,109197,1.90
1,1990-02-01,8.00,8.37,8.47,128.0,5.26,22.11,23.24,31.0,7.0,NaN,NaN,109435,1.87
2,1990-03-01,8.17,8.63,8.59,128.6,5.24,20.39,4.67,31.0,7.0,NaN,NaN,109644,1.88
3,1990-04-01,8.04,8.72,8.79,128.9,4.71,18.43,-12.53,36.0,5.0,NaN,NaN,109688,1.76
4,1990-05-01,8.01,8.64,8.76,129.1,4.37,18.20,-9.54,36.0,5.0,NaN,NaN,109839,1.78

Average Hourly Earnings

In [15]:
# Read the Avg Hourly Earnings data
earnings_csv = "Avg_Hourly_Earnings/avg_hourly_earnings.csv"
earnings_df = pd.read_csv (earnings_csv)
print(f'The number of rows of data for Avg Hourly Earnings Data is {len(earnings_df.index)}')
earnings_df.head()

The number of rows of data for Avg Hourly Earnings Data is 665

         date  avg_earnings  pct_chg_avg_earnings
0  1964-01-01          2.50                   NaN
1  1964-02-01          2.50                   NaN
2  1964-03-01          2.51                   NaN
3  1964-04-01          2.52                   NaN
4  1964-05-01          2.52                   NaN

In [21]:
# Merge the Avg Hourly Earnings Data into the main dataframee
national_df = pd.merge (main_and_employment_df, earnings_df, on="date")
print(f'The number of rows of data for the National dataframe is now {len(national_df.index)}')
national_df.head()

The number of rows of data for the main dataframe is now 348

,date,st_interest,it_interest,lt_interest,cpi_index,pct_chg_cpi,oil_price,pct_chg_oil_price,mtg_purchase,mtg_refi,pct_chg_mtg_purchase,pct_cht_mtg_refi,employment,pct_chg_employment,avg_earnings,pct_chg_avg_earnings
0,1990-01-01,7.90,8.09,8.21,127.5,5.20,22.86,26.86,31.0,7.0,NaN,NaN,109197,1.90,10.02,3.83
1,1990-02-01,8.00,8.37,8.47,128.0,5.26,22.11,23.24,31.0,7.0,NaN,NaN,109435,1.87,10.07,4.03
2,1990-03-01,8.17,8.63,8.59,128.6,5.24,20.39,4.67,31.0,7.0,NaN,NaN,109644,1.88,10.11,4.23
3,1990-04-01,8.04,8.72,8.79,128.9,4.71,18.43,-12.53,36.0,5.0,NaN,NaN,109688,1.76,10.12,3.79
4,1990-05-01,8.01,8.64,8.76,129.1,4.37,18.20,-9.54,36.0,5.0,NaN,NaN,109839,1.78,10.16,4.31

In [22]:
# In the NYC and TX data (below), the data starts in 2007.  The National Data starts in 1990.  To take advantage of
# the longer history of the national data, we will write the data to a CSV file here, for use in visualization,
# then merge with NYC and TX, and create a second CSV file with a shorter time history.
# Write out the national dataframe to a CSV file
output_filename = "national_dataframe.csv"
national_df.to_csv (output_filename, index=False)

Load the data on NY & TX employment and wages, from David Grace's API notebook.

In [28]:
# Read the NYC data
nyc_csv = "output/nyc_wage_and_employment.csv"
nyc_df = pd.read_csv (nyc_csv)
nyc_df.drop(['period','year','nyc_u_rate'], axis=1, inplace=True)
print(f'The number of rows of data for NYC Data is {len(nyc_df.index)}')
nyc_df.head()

The number of rows of data for NYC Data is 148

   nyc_lbr_pool   nyc_wage        date  pct_chg_nyc_lbr_pool  pct_chg_nyc_wage
0      11367991  27.684418  2007-01-01                   NaN               NaN
1      11362757  27.593175  2007-02-01                 -0.05             -0.33
2      11370059  27.206743  2007-03-01                  0.06             -1.40
3      11320972  27.507567  2007-04-01                 -0.43              1.11
4      11346211  27.003579  2007-05-01                  0.22             -1.83

In [29]:
# Merge the NYC Data into the main dataframee
national_with_nyc_df = pd.merge (national_df, nyc_df, on="date")

# Drop any rows that have one or more "NaN"
national_with_nyc_df.dropna(inplace=True)
print(f'The number of rows of data for the National with NYC dataframe is now {len(national_with_nyc_df.index)}')
national_with_nyc_df.head()

The number of rows of data for the National with NYC dataframe is now 143

,date,st_interest,it_interest,lt_interest,cpi_index,pct_chg_cpi,oil_price,pct_chg_oil_price,mtg_purchase,mtg_refi,pct_chg_mtg_purchase,pct_cht_mtg_refi,employment,pct_chg_employment,avg_earnings,pct_chg_avg_earnings,nyc_lbr_pool,nyc_wage,pct_chg_nyc_lbr_pool,pct_chg_nyc_wage
1,2007-02-01,5.16,4.85,4.72,204.226,2.42,59.28,-3.81,88.0,103.0,-13.44,1.31,137573,1.34,17.15,4.07,11362757,27.593175,-0.05,-0.33
2,2007-03-01,5.08,4.57,4.56,205.288,2.80,60.44,-3.59,88.0,103.0,-13.44,1.31,137810,1.28,17.22,4.11,11370059,27.206743,0.06,-1.40
3,2007-04-01,5.01,4.67,4.69,205.904,2.59,63.98,-7.86,115.0,110.0,-15.69,3.12,137860,1.20,17.27,3.79,11320972,27.507567,-0.43,1.11
4,2007-05-01,4.87,4.77,4.75,206.755,2.71,63.46,-10.42,115.0,110.0,-15.69,3.12,138012,1.29,17.34,4.14,11346211,27.003579,0.22,-1.83
5,2007-06-01,4.74,4.98,5.10,207.234,2.69,67.49,-4.88,115.0,110.0,-15.69,3.12,138088,1.28,17.42,4.19,11508241,27.162935,1.43,0.59

In [31]:
# Read the TX data
tx_csv = "output/tx_wage_and_employment.csv"
tx_df = pd.read_csv (tx_csv)
tx_df.drop(['period','year','tx_u_rate','tx_unemployed'], axis=1, inplace=True)
print(f'The number of rows of data for TX Data is {len(tx_df.index)}')
tx_df.head()

The number of rows of data for TX Data is 148

   tx_lbr_pool    tx_wage        date  pct_chg_tx_lbr_pool  pct_chg_tx_wage
0      5986227  22.256440  2007-01-01                  NaN              NaN
1      5974468  22.286868  2007-02-01                -0.20            -4.17
2      5986862  22.719550  2007-03-01                 0.21            -8.70
3      5977430  23.175656  2007-04-01                -0.16            -4.76
4      5987626  23.059917  2007-05-01                 0.17             0.00

In [32]:
# Merge the TX Data into the main dataframee
regional_df = pd.merge (national_with_nyc_df, tx_df, on="date")

# Drop any rows that have one or more "NaN"
regional_df.dropna(inplace=True)
print(f'The number of rows of data for the Regional dataframe is now {len(regional_df.index)}')
regional_df.head()

The number of rows of data for the Regional dataframe is now 143

,date,st_interest,it_interest,lt_interest,cpi_index,pct_chg_cpi,oil_price,pct_chg_oil_price,mtg_purchase,mtg_refi,...,avg_earnings,pct_chg_avg_earnings,nyc_lbr_pool,nyc_wage,pct_chg_nyc_lbr_pool,pct_chg_nyc_wage,tx_lbr_pool,tx_wage,pct_chg_tx_lbr_pool,pct_chg_tx_wage
0,2007-02-01,5.16,4.85,4.72,204.226,2.42,59.28,-3.81,88.0,103.0,...,17.15,4.07,11362757,27.593175,-0.05,-0.33,5974468,22.286868,-0.20,-4.17
1,2007-03-01,5.08,4.57,4.56,205.288,2.80,60.44,-3.59,88.0,103.0,...,17.22,4.11,11370059,27.206743,0.06,-1.40,5986862,22.719550,0.21,-8.70
2,2007-04-01,5.01,4.67,4.69,205.904,2.59,63.98,-7.86,115.0,110.0,...,17.27,3.79,11320972,27.507567,-0.43,1.11,5977430,23.175656,-0.16,-4.76
3,2007-05-01,4.87,4.77,4.75,206.755,2.71,63.46,-10.42,115.0,110.0,...,17.34,4.14,11346211,27.003579,0.22,-1.83,5987626,23.059917,0.17,0.00
4,2007-06-01,4.74,4.98,5.10,207.234,2.69,67.49,-4.88,115.0,110.0,...,17.42,4.19,11508241,27.162935,1.43,0.59,6062070,22.673706,1.24,15.00

In [33]:
# Write out the regional dataframe to a CSV file
output_filename = "regional_dataframe.csv"
regional_df.to_csv (output_filename, index=False)